
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/12075599095)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 5 to change, 1 to destroy.</code></pre>

* Create
  * aws_s3_bucket_object.demo_page
  * local_file.demo_page
  * local_file.index_page
* Update
  * aws_dynamodb_table.Link_table
  * aws_lambda_function.lambda
  * aws_lambda_function.scan
  * aws_s3_bucket.images
  * aws_s3_bucket.website
* Replace
  * aws_lambda_layer_version.test_lambda_layer


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
        id             = "Link_table"
        name           = "Link_table"
      ~ read_capacity  = 0 -> 3
        tags           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
      ~ write_capacity = 0 -> 1
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "user_registration_consulcam"
      ~ layers                         = [
          - "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6",
        ] -> (known after apply)
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "scan_user_consulcam"
      ~ layers                         = [
          - "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6",
        ] -> (known after apply)
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "test_lambda_layer" {
      ~ arn                         = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6" -> (known after apply)
      ~ compatible_runtimes         = [ # forces replacement
          - "python3.7",
            # (1 unchanged element hidden)
        ]
      ~ created_date                = "2024-08-30T14:35:27.663+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "omok6jlQ4kaPJ6wGGcFhL/PRmmolRf+6OVw6mwITX+w=" -> (known after apply)
      ~ source_code_size            = 29433622 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.demo_page will be created
  + resource "aws_s3_bucket_object" "demo_page" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "demo.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/demo.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 4 to add, 5 to change, 1 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":195,"Program":"tfcmt","SHA1":"4715e82003b1b679d9792b53188ffd16dd8a9030","Vars":{},"WorkflowName":"Deploy cases"} -->